# 1. Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.

def func_1(num1, num2):
    try:
        round(num1 / num2, 2)
        return round(num1 / num2, 2)
    except ZeroDivisionError:
        print("Делить на ноль низзя.")


print(func_1(int(input("Введите первое число: ")), int(input("Введите второе число: "))))


# 2. Реализовать функцию, принимающую несколько параметров, описывающих данные пользователя:
# имя, фамилия, год рождения, город проживания, email, телефон.
# Функция должна принимать параметры как именованные аргументы. Реализовать вывод данных о пользователе одной строкой.

def func_2():
    name = input("Введите имя: ")
    surname = input("Введите фамилию: ")
    birth_y = int(input("Год рождения: "))
    home_city = input("Город проживания: ")
    email = input("Адрес электронной почты: ")
    tel = int(input("Номер телефона: "))
    print(f"{name} {surname} {birth_y}-го года рождения из города {home_city}. Email: {email}, тлф.: {tel}")


func_2()

# 3. Реализовать функцию my_func(), которая принимает три позиционных аргумента, и возвращает сумму наибольших
# двух аргументов.


def func_3(a_1, a_2, a_3):
    return sum(sorted([a_1, a_2, a_3])[-2:])


print(func_3(int(input("Первый аргумент: ")), int(input("Второй аргумент: ")), int(input("Третий аргумент: "))))

# 4. Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y. Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
# Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в степень с помощью оператора **.
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.


def func_4(x, y):
    if float(x) >= 0 > int(y):
        """Условие выполонится, только если х - действительное и положительное, а у - отрицательное"""
        print(round(x ** y, 4))
        """Деление с округлением до 4 знаков после запятой"""
    elif int(x) >= 0 > int(y):
        print(round(x ** y, 4))
    else:
        print("Incorrect input.")
        """Выводим сообщение об ошибке, если пользователь вводит не число"""


print(func_4(int(input("Введите положительное число: ")), int(input("Степень (отр.): "))))
"""Запрашиваем у пользователя аргументы и преобразовываем их в числовой формат"""

# 5. Программа запрашивает у пользователя строку чисел, разделенных пробелом.
# При нажатии Enter должна выводиться сумма чисел. Пользователь может продолжить ввод чисел, разделенных пробелом
# и снова нажать Enter. Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.

# Но если вместо числа вводится специальный символ, выполнение программы завершается. Если специальный символ введен
# после нескольких чисел, то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого
# завершить программу.


def func_5():
    count = 0
    while True:
        string = input("Введите числа, разделяя пробелом: ").split()
        for i in string:
            if i == 'q':
                return count
            else:
                try:
                    count += int(i)
                except ValueError:
                    print("Incorrect input")
        print(f'Сумма: {count}')


func_5()

# 6. Реализовать функцию int_func(), принимающую слово из маленьких латинских букв и возвращающую его же,
# но с прописной первой буквой. Например, print(int_func(‘text’)) -> Text.
# Продолжить работу над заданием. В программу должна попадать строка из слов,
# разделенных пробелом. Каждое слово состоит из латинских букв в нижнем регистре.
# Сделать вывод исходной строки, но каждое слово должно начинаться с заглавной буквы.
# Необходимо использовать написанную ранее функцию int_func().


def func_6(word):
    lat = "abcdefghijklmnopqrstuvwxyz"
    return word.title() if not set(word).difference(lat) else False


string = input("Введите слова латинскими буквами: ").split()
for i in string:
    result = func_6(i)
    if result:
        print(func_6(i), ' ')
