# Задача 1. Создание переменных, запрос чисел и строк, вывод результата на экран

name = input("Введите имя ")
age = int(input("Введите возраст "))
diagnosis = input("Диагноз ")
print("Пациент {}, возраст: {}, диагноз: {}.".format(name, age, diagnosis))

cost = int(input("Введите стоимость товара "))
discountSum = int(input("Введите сумму скидки "))
result = int(cost - discountSum)
print(f"Окончательная стоимость: {result}.")

pages_tot = int(input("Введите кол-во страниц "))
rate = 1.5
symb = 1800 * pages_tot
print(f"Стоимость перевода документа: {rate * symb}")

# Задача 2. Пользователь вводит время в секундах.
# Переведите время в часы, минуты и секунды и выведите в формате чч:мм:сс. Используйте формтирование строк.

time = int(input("Введите время (сек): "))
hour = time // 3600  # делим без остатка
min = time // 60 - hour * 60
sec = time % 60  # получаем остаток
print(f"{hour:02}:{min:02}:{sec:02}")

# Задача 3. Узнайте у польователя чило n. Найдите сумму чисел n + nn + nnn.
# Например, пользователь ввел число 3. Считаем 3 + 33 + 333 = 369

n = int(input("Введите число "))
nn = int(f'{n}' + f'{n}')
nnn = int(f'{n}' + f'{n}' + f'{n}')
print(int(n + nn + nnn))

# Задача 4. Пользователь вводит целое положительное число. Найдите самую большую цифру в числе.
# Для решения используйте цикл while и арифметические операции.

number = int(input("Введите целое положительное число "))
max = number % 10
number = number // 10
while number > 0:
    if number % 10 > max:
        max = number % 10
    number = number // 10
print(max)

# Задача 5. Запросите у пользователя значения выручки и издержек фирмы.
# Определите, с каким финансовым результатом работает фирма (прибыль - выручка больше издержек,
# или убыток - издержки больше выручки) Выведите сообщение. Если фирма отработала с прибылью,
# вычислите рентабельность выручки (соотношение прибыли к выручке). далее запросите численность
# сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника.

revenue = int(input("Выручка компании: "))
expenses = int(input("Издержки: "))
if revenue > expenses:
    print(f"Компания получает прибыль {revenue - expenses}")
    profit = f"{100 * (revenue - expenses) / revenue:.2f}%"
    print(f"Рентабельность выручки составляет {profit}")
    staff = int(input("Введите количество сотрудников "))
    st_profit = revenue / staff
    print("Прибыль фирмы в рассчете на одного сотрудника составляет {:.3f}".format(st_profit))
elif revenue < expenses:
    print("Компания несет убытки.")

# Задача 6. Спортсмен бегает ежедневно. В первый день его результат составил а километров.
# каждый день спортсмен увеличивал результат на 10% относительно предыдущего.
# Определите номер дня, на который общий результат спортсмена составит не менее b километров.
# ПРограмма должна принимать значения параметров а и b и выводить одно натуральное число - номер дня
# например: a = 1 (день), в = 3 (км). На н-й день спортсмен достиг результата - не менее н км.

a = int(input("Расстояние в первый день: "))
b = int(input("Ваша цель: "))
i = 1
while a <= b:
    a *= 1.1
    i += 1
print(f"Вы достигните цели на {i}-й день")